/*eslint-disable*/
/**
 * Created by WangDunWen on 2018/4/23.
 * miracle 1.0
 * JS基础知识
 */

// --------------------------------------------------------------------------
// 1、Css控制元素内文字长度，如果超出则替换...
//
// ****************************** result ************************************
`
	.text {
		width: 200px;
		white-space: nowrap;
		text-overflow: ellipsis;
		overflow: hidden;
	}
`
// white-space: nowrap; 强制在一行内显示所有文本，不换行
// text-overflow: ellipsis; CSS3新增属性；
// 				  clip 不显示省略标记...，而是简单的裁切
// 				  ellipsis 当文本溢出时显示...
// overflow: hidden; 让多余文字在ff中隐藏
// --------------------------------------------------------------------------



// --------------------------------------------------------------------------
// 2、Css中em和rem的区别
//
// ****************************** result ************************************
// rem是相对于根的em，rem即root的em，相对于html根元素的em;
// em是相对长度单位，相对于当前对象内文本的字体尺寸。如当前行内文本的字体尺寸
// 未被人为设置，则相对于浏览器的默认字体尺寸;
// 总结：rem单位翻译为像素值是由html元素的字体大小决定的，此字体大小由浏览器
// 中字体大小的设置决定，除非显示的重写一个具体单位。em单位转为像素值，取决于
// 他们使用的字体大小，此字体大小由父元素继承而来，除非显示重写一个具体的单位。
// --------------------------------------------------------------------------